:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
::::::::: 깃헙 웹->로컬 리포지토리 클론 배치파일  :::::::::
:::::::::                                         :::::::::
::::::::: 준비물                                  :::::::::
::::::::: 1. 파일이 존재하는 깃헙 원격 리포지토리 :::::::::
::::::::: 2. 해당 URL(https~.git) 복사            :::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

@echo off

chcp 65001
cls

set /p url="깃헙 URL(https~.git) > "
set /p repo="리포지토리 이름 > "


cd .
git clone %url%

cd %repo%
xcopy *.* .. /e /h /k /y

cd ..
echo.Y|rmdir %repo% /s


echo.==============================
echo. 깃헙 리포지토리 클론 완료 !
echo.==============================

pause > nul
